app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT `books`.* FROM `books`

  def show
    @book = Book.find(params[:id])
    @relations = Relation.find(:all, :conditions => ["book_id = ?", params[:id]])
---
SELECT `books`.* FROM `books` WHERE (id = NULL) ORDER BY `books`.`id` DESC LIMIT 1
SELECT `relations`.* FROM `relations` WHERE (book_id = 'id')

  def create
    @book = Book.new(params[:book])
    @relation = Hash.new

    respond_to do |format|
      if @book.save
---
INSERT INTO `books` (`author`, `category`, `cover_l_url`, `cover_s_url`, `created_at`, `description`, `isbn`, `publisher`, `src_url`, `status_des`, `title`, `updated_at`) VALUES (NULL, NULL, NULL, NULL, '2012-08-23 02:25:59', NULL, NULL, NULL, NULL, NULL, NULL, '2012-08-23 02:25:59')

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 15 LIMIT 1
UPDATE `books` SET `description` = '과학 베스트셀러 <정재승의 과학 콘서트> 출간 10주년 기념 개정증보판 『과학 콘서트』는 분야를 넘나드는 통합적 지식과 사유를 보여주며 세대를 초월해 즐길 수 있는 지식논픽션으로, 많은 독자들에게...', `author` = '정재승', `status_des` = '정상판매', `updated_at` = '2012-09-06 09:47:01' WHERE `books`.`id` = 19

  def destroy
    @book = Book.find(params[:id])
    @book.destroy
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 1