app/controllers/relations_controller.rb

SELECT `relations`.* FROM `relations`
---
  def index
    @relations = Relation.all

SELECT `relations`.* FROM `relations` WHERE `relations`.`id` = 1 LIMIT 1
---
  def show
    @relation = Relation.find(params[:id])

SELECT `books`.* FROM `books` WHERE (isbn = '8989899729') LIMIT 1
---
  def new
    @relation = Relation.new
    @target = params[:target]
    @book_id = params[:book_id]

    @book_isbn = nil
    @related_book = nil
    @book_already_exists = nil
    @book_already_id = nil

    if @target != nil then
      @book_isbn = @target['isbn']
      @related_book = Book.find(:first, :conditions=> ["isbn = ?", @book_isbn])

INSERT INTO `books` (`author`, `category`, `cover_l_url`, `cover_s_url`, `created_at`, `description`, `isbn`, `publisher`, `src_url`, `status_des`, `title`, `updated_at`) VALUES ('진중권', '인문 ', 'http://book.daum-img.net/P110x160/KOR9788989899716', 'http://book.daum-img.net/P72x100/KOR9788989899716', '2012-08-27 05:55:37', '미학에 대해서 쉽게 풀어 설명하여 미학의 대중화를 이끈 교양서 &lt;미학 오디세이&gt;. 에셔와 마그리트, 특이한 두 명의 화가를 함께...데리다, 들뢰즈 등 탈근대의 관점에서 미학을 소개하는 프랑스 사상가들을...', '8989899710', '휴머니스트', 'http://book.daum.net/detail/book.do?bookid=KOR9788989899716', '정상판매', '미학 오디세이 세트', '2012-08-27 05:55:37')
INSERT INTO `relations` (`book_id`, `comment`, `created_at`, `related_entity_id`, `updated_at`) VALUES (NULL, 'test', '2012-08-27 04:11:29', 2, '2012-08-27 04:11:29')
---
  def create
    @book = Book.new(params[:book])
    @relation = nil
    if @book.save
      @relation = params[:relation]
      @relation['related_entity_id'] = @book.id

      @relation = Relation.new(params[:relation])

      respond_to do |format|
        if @relation.save

SELECT `relations`.* FROM `relations` WHERE `relations`.`id` = 1 LIMIT 1
DELETE FROM `relations` WHERE `relations`.`id` = 1
---
  def destroy
    @relation = Relation.find(params[:id])
    @relation.destroy